const data = [
  [
    [
      "대형 망치 머리",
      "긴 손잡이"
    ],
    [
      "해머",
      "나이프"
    ],
    [
      "긴 도구 조립하기"
    ],
    [
      "단조 대형 망치"
    ]
  ],
  [
    [
      "구멍 뚫린 강철 주괴",
      "석탄 ×9"
    ],
    [
      "해머",
      "금속 집게",
      "금속 가공 타공기",
      "금속 가공 끌"
    ],
    [
      "대형 망치 머리 세공하기",
      "금속세공 레벨 8"
    ],
    [
      "대형 망치 머리"
    ]
  ],
  [
    [
      "강철 주괴",
      "석탄 ×4"
    ],
    [
      "해머",
      "금속 집게",
      "금속 가공 타공기"
    ],
    [
      "주괴 뚫기",
      "금속세공 레벨 3"
    ],
    [
      "구멍 뚫린 강철 주괴"
    ]
  ],
  [
    [
      "대형/소형 세라믹 도가니 (철 포함) ×12",
      "석탄 ×18",
      "석회암 ×18"
    ],
    [
      "금속 집게",
      "세라믹 주괴 거푸집"
    ],
    [
      "철로 강철 주괴 만들기"
    ],
    [
      "강철 주괴"
    ]
  ],
  [
    [
      "굽지 않은 대형/소형 점토 도가니",
      "석탄"
    ],
    [
      "점화기"
    ],
    [
      "도가니 굽기"
    ],
    [
      "대형/소형 세라믹 도가니"
    ]
  ],
  [
    [
      "점토 ×2"
    ],
    [
      "모래 주머니"
    ],
    [
      "도가니 빚기/작은 도자기 도가니 빚기",
      "도예 1"
    ],
    [
      "굽지 않은 대형/소형 점토 도가니"
    ]
  ],
  [
    [
      "대형/소형 세라믹 도가니",
      "석탄 ×4",
      "철 아이템"
    ],
    [
      "금속 집게"
    ],
    [
      "대형/중형/소형/... 철 아이템 융해하기"
    ],
    [
      "대형/소형 세라믹 도가니 (철 포함)"
    ]
  ],
  [
    [
      "굽지 않은 점토 주괴 거푸집",
      "석탄"
    ],
    [
      "점화기"
    ],
    [
      "점토 주괴 거푸집 굽기"
    ],
    [
      "세라믹 주괴 거푸집"
    ]
  ],
  [
    [
      "점토"
    ],
    [
      "나무 주괴 거푸집"
    ],
    [
      "주괴 거푸집 프레스 가공하기"
    ],
    [
      "굽지 않은 점토 주괴 거푸집"
    ]
  ],
  [
    [
      "판자",
      "못"
    ],
    [
      "해머",
      "톱"
    ],
    [
      "주괴 거푸집 만들기",
      "목공 2"
    ],
    [
      "주괴 거푸집 만들기"
    ]
  ],
  [
    [
      "판자",
      "큰 나뭇가지"
    ],
    [
      "나이프"
    ],
    [
      "긴 손잡이 조각하기",
      "조각술 3"
    ],
    [
      "긴 손잡이"
    ]
  ]
];